[{"id":"3652657947","userName":"Freeverse33","userUrl":"https://itunes.apple.com/us/reviews/id134525036","version":"2.8.1","score":5,"title":"The best, hands down","text":"Perfect blend a simple and complex, science and spirit, heaven and earth.  This tool has been a gift of guidance for all my curious needs.  Seemingly limitless Charts, transitions, and indexes with enough help to breakdown what you’re seeing, this can satisfy a beginner to advanced level astro-phile.","country":"USA"},{"id":"3596575214","userName":"KMS2014","userUrl":"https://itunes.apple.com/us/reviews/id11755086","version":"2.8","score":5,"title":"Outstanding application","text":"I’ve studied astrology for years and I really love this application!  Very clear and easy to use and just packed with information!  \n\nI love the celestial information that shows exactly what’s happening in the sky when the astrological aspect is in effect.  I always found it difficult to translate the information in an astrological chart to what’s actually going on in the sky and it’s amazing that I can do that now.  I I just discovered that feature today and see the names of the stars but I’m wondering if the names of the constellations also appear? Perhaps I haven’t just haven’t found them yet.  \n\nAnd it Is really wonderful that this application is free, but I’m going to make a contribution as it is well worth paying some money for such a great tool.\n\nThanks!","country":"USA"},{"id":"3589585990","userName":"Starman6","userUrl":"https://itunes.apple.com/us/reviews/id135124154","version":"2.8","score":5,"title":"Just Keeps Getting Better","text":"There is so much useful information offered for free that I don’t even need the add-ons. But, I purchase them anyway just to support the developer.\nJust the Personal Events and Summary sections are pure gold for me.\nThe only additions I would  ask for is to provide more information for the planets on the outside of the wheel such as degrees, and perhaps Nakshatras. Larger glyphs would be nice too. There is so much empty space inside the wheel that is devoted solely to aspect lines that could be better utilized. People familiar with astrology can easily see aspects on their own. Having an option to turn off aspects and add more information on the outside would be awesome. Secondly, providing an Ephemeris add-on showing a whole month at a time would also be incredibly useful and I would gladly pay for that feature.\nLove the blog,too! Great job, Denis 👍🏼","country":"USA"},{"id":"3581145988","userName":"Annnnnia","userUrl":"https://itunes.apple.com/us/reviews/id43071651","version":"2.8","score":5,"title":"Disappointed","text":"The charts are great but no interpretation. I purchased several add ons which was a total waste because you need to be an astrologer to use. What a waste of money.","country":"USA"},{"id":"3617632506","userName":"Knyght","userUrl":"https://itunes.apple.com/ca/reviews/id17948886","version":"2.8","score":5,"title":"Great app","text":"This app is a true gem!","country":"Canada"},{"id":"3550755573","userName":"fvcksophia","userUrl":"https://itunes.apple.com/ca/reviews/id373341700","version":"2.8","score":5,"title":"I put Jesus’s birthday for funsies and the app crashed","text":"Still ain’t working either. Still love this app","country":"Canada"},{"id":"3545216988","userName":"Electric Kick Slide Mam","userUrl":"https://itunes.apple.com/us/reviews/id436355899","version":"2.7.3","score":5,"title":"Great App for All","text":"I find myself in the study of astrology and I could not be more pleased with the software created to track transits in real time for locations/natal charts. I do see the benefit of adding my own astrological notes and use of diary for moon transits. Time Nomad Blog is very informative and great material to read to further your knowledge and usage of this astrological companion.","country":"USA"},{"id":"3539848087","userName":"ashlenvictoria","userUrl":"https://itunes.apple.com/us/reviews/id178890272","version":"2.7.3","score":5,"title":"Awesome","text":"Great features","country":"USA"},{"id":"3509377072","userName":"rezabahrami","userUrl":"https://itunes.apple.com/us/reviews/id444055106","version":"2.7.3","score":5,"title":"like","text":"👍👍👍👍","country":"USA"},{"id":"3490071244","userName":"KSG709","userUrl":"https://itunes.apple.com/us/reviews/id254745906","version":"2.7.3","score":3,"title":"Low contrast font w/tiny type = hard to see","text":"I’d give Time Nomad a higher score IF I could read it. Because of the low contrast font color and small size type, coupled with a screen that doesn’t enlarge, makes this Tome Nomad a non-visible app to my 58 year old eyes that use 1.25 magnifying reading glasses. Seems like if your going to use the type and color scheme you’ve chosen you should make the screen enlargable, otherwise you are making Time Nomad useless for anyone without perfect eyesight. Looks like a good program but I can’t be sure because I just can’t see it.\n\nTo Gary - the developer - the solution to this problem is SIMPLE. Put all fonts in BLACK ink against a WHITE background.  That’s all you have to do - provide contrast so the letters can be seen.  \n\nEven if the font size is small, IF the developer provides high-contrast letters (i.e., black letters on white background) then older eyes can read your app.  Otherwise, it’s not much use, if you can’t see it.","country":"USA"},{"id":"3484024648","userName":"syphre lu","userUrl":"https://itunes.apple.com/us/reviews/id463264286","version":"2.7.3","score":5,"title":"Probably my first and only review.","text":"I've never felt so inclined to praise an app until I downloaded this one. The easy to read and beautiful format helped me pick up on reading circle charts fast and isn't messy. I can discern the aspects and glance at them and I love having the option to get more accurate details. The add-ons are nice too and I like that I don't need them to use the app but it adds nice 'flavor'. I frequently delete apps when I get bored of them or feel they're useless but this is a mainstay in my phone. My only wish is that this would have a sister app that would further expand and explain different aspects and tidbits and extensive astro information. I've been searching long for an app to pair with this gem but for now, this app is immaculate. Thank you.","country":"USA"},{"id":"3464468644","userName":"rmark1000","userUrl":"https://itunes.apple.com/us/reviews/id889657859","version":"2.7.3","score":5,"title":"Super awesome app!!","text":"Time Nomad does a lot of the stuff that pc astrology apps do for tens or even hundreds of dollars.  It’s the very best astrology tool I have been able to find that is not advertised as a professional program for a lot of money.  Powerful, user friendly, steadily being improved upon by the developer.","country":"USA"},{"id":"3453264364","userName":"Fleurmaibe","userUrl":"https://itunes.apple.com/us/reviews/id269514698","version":"2.7.3","score":5,"title":"Great Learning And Visual Tool","text":"This is by far the best app I could find for what I wanted to do -learn by jumping in headfirst and exploring without consistent paid roadblocks. While I have since bought two add-ons I don’t think it’s at all necessary to do so to fully enjoy and learn. There’s tons of options and generally “ok” explanations (I use them as a springboard to google so it’s not really a necessity nor the point of this app). I enjoy the blog (although I believe the RSS subscribe feature is faulty and if it could be fixed I’d love to be able to sub). Really lovely visuals - it’s not tacky or distracting:) I tend to use this more than any desktop option as it’s very clean and easy to separate information out. I really hope the updates keep coming! Right now I wish there was an easy was to see things like Grand Trines and Kites (labeled) as I’m still learning and it’s a bit difficult to decide if what I’m seeing just looks similar or is actually within the reasonable degrees to be considered so but maybe I’m missing something!","country":"USA"},{"id":"3385442257","userName":"sadastro","userUrl":"https://itunes.apple.com/us/reviews/id110429259","version":"2.7.3","score":5,"title":"No sidereal","text":"Sidereal option does not work.\n\nEdit: I was able to get sidereal to work. Thank you!","country":"USA"},{"id":"3331330196","userName":"kacy danae","userUrl":"https://itunes.apple.com/us/reviews/id387326804","version":"2.7.3","score":5,"title":"Best Astrology app out there!","text":"I can’t speak more highly of this app! With natal, transit, progression and synastry available and room to add loads of people this app is usual for the lay astrologer and the professional! A must have!","country":"USA"},{"id":"3314466585","userName":"alargeCat","userUrl":"https://itunes.apple.com/us/reviews/id325669477","version":"2.7.3","score":5,"title":"CLASSY APP, CLASSIER DEVELOPER","text":"If you’ve been waiting for the ultimate chart-producing app for mobiles since the launch of iPhone and patiently tinkering with AstroDienst, WAIT NO MORE! Download this app IMMEDIATELY and put powerful chart computation at your fingertips within seconds!\n\nTimeNomad combines essential sets of charts with attractive graphic displays and cutting-edge discoveries, including transit charts, progressed charts, synastry charts, composite charts, planetary hours, aspectarians; tropical and sidereal options, minor bodies such as asteroids, Chiron, KBOs; and illuminating points such as the lunar nodes, vertex, and POF. The add-ons are worth the price and enhancements keep on coming!\n\nAnd speaking of the cool developments, the developer himself shows his professionalism and passion for the craft and his creation by paying attention to feedback and dialoguing with users if errors are found in beta releases, and with speed and dedication too!\n\nThis is a next-gen must-have Western astrology tool for any professional. My favorite functionality is being able to isolate specific aspects for pattern analysis and scroll forwards and backwards thru time. Plus, Denis’ professional demeanor has me sold for life. Thank you!","country":"USA"},{"id":"3318808619","userName":"spectator!!!","userUrl":"https://itunes.apple.com/gb/reviews/id781634963","version":"2.7.3","score":5,"title":"😀😀😀","text":"“Tidy”","country":"UK"},{"id":"3347438143","userName":"FredPhanGan","userUrl":"https://itunes.apple.com/fr/reviews/id208032140","version":"2.7.3","score":5,"title":"Excellente et généreuse app","text":"Un must pour tout astrologue/astronome pro/amateur.","country":"France"},{"id":"3338523310","userName":"alexvzhik","userUrl":"https://itunes.apple.com/ru/reviews/id529114127","version":"2.7.3","score":5,"title":"Приложение супер!","text":"Но нет русского языка. Сделайте пожалуйста 🙏🙏🙏👍🏻","country":"Russia"},{"id":"3431614850","userName":"Meow72","userUrl":"https://itunes.apple.com/es/reviews/id266200685","version":"2.7.3","score":5,"title":"best astrology’s app!","text":"its really complete, the only thing that id say that would make it a 10/10 is a brief explanation of the aspects that are shown, nevertheless its a 10 :)","country":"Spain"},{"id":"3432214139","userName":"burnoaff","userUrl":"https://itunes.apple.com/br/reviews/id832914923","version":"2.7.3","score":5,"title":"GREAT","text":"the best i have ever found","country":"Brazil"},{"id":"3423334446","userName":"ednar500","userUrl":"https://itunes.apple.com/nl/reviews/id729423966","version":"2.7.3","score":4,"title":"Very Good","text":"Interesting , But a little misstake I think sun has a magnitude of -26,5 en not +4.5","country":"Netherlands"},{"id":"3232058310","userName":"Almastral","userUrl":"https://itunes.apple.com/us/reviews/id895573421","version":"2.7.2","score":5,"title":"Useful for professional astrologers","text":"Is a very useful tool to do daily horoscopes","country":"USA"},{"id":"3189813725","userName":"1ces","userUrl":"https://itunes.apple.com/us/reviews/id134521113","version":"2.7.2","score":5,"title":"❤️","text":"Love this app","country":"USA"},{"id":"3271875646","userName":"taffs68","userUrl":"https://itunes.apple.com/gb/reviews/id916239779","version":"2.7.2","score":5,"title":"Great","text":"This is great app to have to hand but would like to have more of breakdown of the daily transit in the chart...","country":"UK"},{"id":"3153787494","userName":"Ouroboros Pan","userUrl":"https://itunes.apple.com/gb/reviews/id799623585","version":"2.7.2","score":5,"title":"Five Star","text":"Couldn't have asked for a better app, has everything I need and then some. Perfect","country":"UK"},{"id":"3150313391","userName":"Prijate5","userUrl":"https://itunes.apple.com/ca/reviews/id140205770","version":"2.7.2","score":5,"title":"The BEST","text":"This is the best, constantly updated and easy to use astrology app. I love it and I am recomending it to everyone! THE BEST!","country":"Canada"},{"id":"3204198625","userName":"bargain bin bussy","userUrl":"https://itunes.apple.com/au/reviews/id474167946","version":"2.7.2","score":5,"title":"Amazing","text":"Amazing app, and has the most features I’ve ever seen in an astrology app, let alone a free one! Just one thing though. How do I change my apps time zone out of LA? Can’t seem to find the setting.","country":"Australia"},{"id":"3171709867","userName":"qmbrg","userUrl":"https://itunes.apple.com/it/reviews/id27238909","version":"2.7.2","score":5,"title":"Eccezionale","text":"App di semplice utilizzo ricchissima di informazioni.","country":"Italy"},{"id":"3166451392","userName":"Фабиофабио","userUrl":"https://itunes.apple.com/ru/reviews/id407102667","version":"2.7.2","score":4,"title":"Русский язык","text":"Буду ждать, когда появится русский перевод! Его очень не хватает! Я уверенна, что когда приложение переведут на русский оно станет очень популярным","country":"Russia"},{"id":"3166451379","userName":"Фабиофабио","userUrl":"https://itunes.apple.com/ru/reviews/id407102667","version":"2.7.2","score":4,"title":"Русский язык","text":"Буду ждать, когда появится русский перевод! Его очень не хватает! Я уверенна, что когда приложение переведут на русский оно станет очень популярным","country":"Russia"},{"id":"3134773461","userName":"mdpv1","userUrl":"https://itunes.apple.com/us/reviews/id187134032","version":"2.7.1","score":5,"title":"Excellent Application!","text":"This app is amazing!","country":"USA"},{"id":"3116227621","userName":"Fire Horse 66","userUrl":"https://itunes.apple.com/gb/reviews/id894391765","version":"2.7.1","score":4,"title":"Great free astrology software","text":"This a good app especially as it’s free! I use it to keep an eye on transits but have paid the nominal amount for progressions too. My only negative point is that it doesn’t offer Solar charts but for the basics for a novice astrology person like me this a good day to day, easy to use app. It’s free so why not give it a go?","country":"UK"},{"id":"3146279739","userName":"eyyitsme","userUrl":"https://itunes.apple.com/ar/reviews/id620690760","version":"2.7.1","score":5,"title":"Time Nomad!! Best app ever!!!!!!!!❤️","text":"Great Job!!","country":"Argentina"},{"id":"3108771349","userName":"Mister E seeker","userUrl":"https://itunes.apple.com/us/reviews/id449090474","version":"2.7","score":5,"title":"Most Grateful","text":"This app is awesome. The widget improvement is great. Very useful. \nI give it a quick glance to Check the planetary hour at least 3 times a day. \nThere’s really nothing needing improvement. The author is a dedicated individual aware of users needs. It is beautifully designed with no interference of ads. I like that relationships can be isolated from a chart so as a user I can see what I need without the rest of the vast amount them making a confused screen appearance. \nDeveloper Thank you. Well done.","country":"USA"},{"id":"3093363174","userName":"azkto","userUrl":"https://itunes.apple.com/us/reviews/id506305716","version":"2.7","score":5,"title":"I love the app, but there’s a (very) tiny bug","text":"Everything is amazing on this app I love it so much. The only thing that doesn’t seem to work is when I try to have both mine, and the world event transits, only one will stay on even if I click ‘apply’. Other than that keep up the good work, the app is fantastic!","country":"USA"},{"id":"3063975436","userName":"Tmil3377","userUrl":"https://itunes.apple.com/us/reviews/id198251175","version":"2.7","score":5,"title":"Wow. Just Wow","text":"Bottom line - get it now! This is one of the best, well-structured apps in the Store. Other developers would do well to pattern after what Denis has done. Give tons of value up front, then add some fairly-priced add-ons and create a tip jar. I couldn’t wait to give him the maximum “tip” because of how freakin cool this thing is. Gives you a whole new set of eyes on your chart. I could go on and on...just get the free version and you’ll see for yourself! Hopefully you’ll be generous with him because this dude deserves it! Thank you Denis - hopefully you develop more like it.","country":"USA"},{"id":"3028608066","userName":"Alex Antares","userUrl":"https://itunes.apple.com/us/reviews/id767599308","version":"2.7","score":5,"title":"Nothing like it.","text":"Thank you for the work you do that allows us all to stay informed of the changes above while mobile. There’s nothing like this app, or rather, no other that compares.","country":"USA"},{"id":"3069498954","userName":"Kompozitk@","userUrl":"https://itunes.apple.com/gb/reviews/id451934730","version":"2.7","score":5,"title":"Amazing!","text":"This application is absolutely incredible! Very easy to use and understand. I really appreciate such a great job. Thank you!","country":"UK"},{"id":"3010535580","userName":"Daizzyy","userUrl":"https://itunes.apple.com/us/reviews/id302162709","version":"2.6.1","score":5,"title":"Love","text":"I adore this app, and it is by far the best phone astrology app I have found. one thing I would love to see is possibly a place to make notes on a chart, and also the ability to add more asteroids (I love asteroids). but overall, amazing","country":"USA"},{"id":"2959365890","userName":"FlameGuitar85","userUrl":"https://itunes.apple.com/us/reviews/id43612981","version":"2.6.1","score":5,"title":"Amazing and Free","text":"This app is extremely powerful and enlightening. So many features included for free and so well designed and executed. Thank you.","country":"USA"},{"id":"2940532281","userName":"gezah55","userUrl":"https://itunes.apple.com/us/reviews/id43863025","version":"2.6.1","score":5,"title":"“Dark theme” option w’d be more pleasant","text":"Dear developer, I consider the “Time Nomad” an  excellent App.\nBut it would be more pleasant  a “Dark Theme” view option for display.  Hope you could add such feature to “Time Nomad” in the future.\nThank you,  Geza Holzhaker","country":"USA"},{"id":"2908294800","userName":"CADYHERON","userUrl":"https://itunes.apple.com/us/reviews/id118145670","version":"2.6.1","score":5,"title":"Out of this world!!!","text":"Thank you for making such an easy to use and clean app. I’m on it every hour checking the planetary hours ✌️🤠","country":"USA"},{"id":"2895885942","userName":"GreyWitch27","userUrl":"https://itunes.apple.com/us/reviews/id468701244","version":"2.6.1","score":1,"title":"Sorry, But","text":"it seems a wonderful program BUT I don’t & won’t use iCloud (I want My data stored on My iPhone) and I won’t create accounts in 3rd party sites (in this case reddit) even if the app’s developer thinks they’re wonderful.  Glad I learned casting charts back when it was done w/ pencil & paper.  Will stick w/ that for now ...","country":"USA"},{"id":"2886318615","userName":"love olga love","userUrl":"https://itunes.apple.com/ru/reviews/id297160547","version":"2.6.1","score":5,"title":"Очень хочу русскую версию","text":"Наикрутейшая программа!!! Очень удобно","country":"Russia"},{"id":"2929792581","userName":"Pineal","userUrl":"https://itunes.apple.com/es/reviews/id154561284","version":"2.6.1","score":5,"title":"Excelente!","text":"Con diferencia es la mejor app de astrología de las muchas que he probado. ¡Me encanta!","country":"Spain"},{"id":"2865343641","userName":"childjupiter","userUrl":"https://itunes.apple.com/ca/reviews/id491064625","version":"2.6","score":5,"title":"Best ever","text":"This is an awesome app. So many layers and options for more advanced folks and lovely for beginners as well. Love the simple minimalist visual design and UX. A breath of fresh air in the myriad of similar apps without compromising on the depth of information. \nAlso love the planetary hours section  (and there is an alarm option?!? Seriously, who is this amazing dev??)","country":"Canada"},{"id":"2830539447","userName":"VeryGrumpy12121212","userUrl":"https://itunes.apple.com/us/reviews/id225600935","version":"2.5.3","score":5,"title":"LOOK NO FURTHER--SIX STARS. Amazing app. (Follow-up Review)","text":"Look no further, get this app. If you are a serious astrology student, this is the app you need. \n\nThis is a follow-up to my 1st review that Apple did not let me access. \n\nMy 1st review had 3 stars, this is an upgrade. It isn't that something goes wrong that makes an app; something WILL go wrong--it is the nature of software. It is WHAT HAPPENS when it goes wrong that makes the app, and this developer is top shelf.\n\n------------------------------------\nApple strikes again! \nApp Store not able to recognize me while logged in; and hides new reviews miles down in the list. \n\nI wrote a review, downgraded the star rating after paid part of app broke; and wanted to upgrade it again. If I can ever find that review again I will edit it, Time Nomad deserves a SOLID five stars.\n-----------------------------------\n\nThis app is epic. Serious, albeit beginning astrology student here. This app is better than many costing $30 and up! It does require an internet connection; but the bonus is that you get very precise coordinates, and the app takes up less space on your phone, and will run a lot faster as the bulk of the work takes place on the server.\n\nIt is fast, flawless, feature-packed and comes with a great help system which is activated by clicking on the various elements such as f. example transits. \n\nThe paid progression broke; but--this gal is an old geek, been using computers since the -80's and let me tell you; personal service like this is exceptional, and in 2018, downright unheard of. The developer personally answered my query and spent time troubleshooting my issue via e-mail. Color me IMPRESSED! While the part still isn't functional; the rest of the app still is, and I am 100% convinced it will be taken care of. \n\nI have therefore scrapped my plans of buying another program, and instead plan on springing for the asteroid package to make it a complete solution. \n\nI'd give Time Nomad six stars if I could. \n\nThank you Denis!! ☺️👍","country":"USA"},{"id":"2830213212","userName":"Iustin.22","userUrl":"https://itunes.apple.com/us/reviews/id801380832","version":"2.5.3","score":5,"title":"This App does a Stellar Job","text":"This App is perfect for advanced astrologists. I have left multiple 5 star reviews before and with every update, they continue amazing me and make me look forward to the next. I have Immense Gratitude towards the creators of this app. \n\nSuggested Feature: Fixed Stars would be an amazing enhancement to the already detailed graphs. \nInterpretations for aspects in Natal, Transit, Synastry, And Composite charts would be an amazing addition to the app as well.","country":"USA"},{"id":"2807793381","userName":"swblank10","userUrl":"https://itunes.apple.com/us/reviews/id101278765","version":"2.5.3","score":5,"title":"Awesome!","text":"Thank you for developing this awesome app and continuing to add new features, I’m really grateful!","country":"USA"},{"id":"2750655033","userName":"Whyismynametakennoo","userUrl":"https://itunes.apple.com/us/reviews/id492621631","version":"2.5.3","score":5,"title":"Impressed","text":"There's a lot of detail in a decent UI\nIs there a way to set a specific screen as the default/home/one the app opens with? I'd love to set the app to always open straight to the radial chart or timeline.\n\nEdit: Never mind! I just noticed it opened to the last open screen - perfect!\nYou won't find any ADs or required subscriptions or upgrades (except for tracking data for Jupiter's moons and such).\nAll screens are high quality.\nYou won't find another app like this one!","country":"USA"},{"id":"2825972712","userName":"Manciobo77","userUrl":"https://itunes.apple.com/it/reviews/id164318129","version":"2.5.3","score":5,"title":"Hyperfantastic app for all passionate of astrology","text":"Very simple and useful also for beginners as I am.","country":"Italy"},{"id":"2731996904","userName":"AstroCbaron","userUrl":"https://itunes.apple.com/cn/reviews/id529152418","version":"2.5.2","score":5,"title":"支持","text":"iOS上目前唯一能看日心地心制星盘的软件；\n看日心盘的人这么少吗？","country":"China"},{"id":"2714163264","userName":"uranian-astrology","userUrl":"https://itunes.apple.com/es/reviews/id87320729","version":"2.5.1","score":1,"title":"No longer the best astrology app for iOS...","text":"I made a review and gave this app 5 stars recently. I now give 1 star after the update because some free functionalities, like synastry, have become PAID add-ons. I think the developer doesn’t have clear what he wants to give for free and what should be paid, changing his mind over time. It doesn’t make any sense to me to use an app that will no longer have the same basic functionality tomorrow, asking for more money. I bought the rather expensive “Get more planets” pack for more that 10€ and they are now asking me for more money to use synastry, and maybe tomorrow even the natal chart will be a new paid add-on and so on... think before you buy one of the add-ons, they will ask you for more money tomorrow!","country":"Spain"},{"id":"2683711317","userName":"Ohhhhhhhhhhhk","userUrl":"https://itunes.apple.com/us/reviews/id291001313","version":"2.4","score":3,"title":"Love the app, add-on troubles","text":"Love the app and functionality in general. UI is simple and easy. But every time I try to go in and pay for any of the add-ons, or even just tip, it just spins and spins, and won’t ever take me to the actual payable message screen.","country":"USA"},{"id":"2658203448","userName":"jakemstewart23","userUrl":"https://itunes.apple.com/us/reviews/id822060792","version":"2.4","score":5,"title":"Awesome app! But, can’t purchase progressed chart add-on","text":"Trying to buy the new pro add-on, “progressed chart and transits,” but have been unsuccessful in doing so. I get a never ending syncing loop, but nothing proceeds to the purchase. It’s an awesome new feature and I hope you get it fixed soon so I can purchase it! :)","country":"USA"},{"id":"2627432560","userName":"Tacit Majestic","userUrl":"https://itunes.apple.com/us/reviews/id164658400","version":"2.4","score":5,"title":"Are there any options to view Sidereal data with this app?","text":"This app seems extremely thorough in the eyes of a novice like myself. Great job. I have been looking to see if there is an option to view the same data based on Sidereal Astrology but haven’t located it.\nThanks for the effort.\nStuart Bascombe\n\nFound it! Great! I will add to this review as I work with it some more.","country":"USA"},{"id":"2646259831","userName":"BrokenAccidentalStars","userUrl":"https://itunes.apple.com/ca/reviews/id42462888","version":"2.4","score":5,"title":"Clean and Impressively Thorough","text":"So many layers of depth to this app! And a lovely, professional, no-nonsense interface. Virgo rising approves! Hoping the developers will introduce an automatic sorting option for names, but otherwise, this app truly has everything I need.","country":"Canada"},{"id":"2682068759","userName":"Sergey Petrenko","userUrl":"https://itunes.apple.com/ru/reviews/id288542606","version":"2.4","score":5,"title":"Отличное приложение для астролога","text":"Пользуюсь постоянно. Хороший дизайн и отображение астрологических карт","country":"Russia"},{"id":"2595350244","userName":"chadmsicard","userUrl":"https://itunes.apple.com/us/reviews/id35897613","version":"2.3","score":5,"title":"The app I’ve always wanted!","text":"Aside of a couple tweaks on dignities and almutens, this app is truly useful for every student of astrology. It’s beautiful and easy to navigate. Tracking transits has never been easier; it has notifications built in. I gladly bought the update and will support this app as long as it’s available.","country":"USA"},{"id":"2548826033","userName":"Brandonreidak","userUrl":"https://itunes.apple.com/us/reviews/id256272138","version":"2.3","score":5,"title":"The best astrology app.","text":"You can change house systems, the functionality is really great. I love the widget that shows the current chart and the force push for seeing the moon phase. Outstanding app, really. Beautiful design as well.","country":"USA"},{"id":"2525011166","userName":"8JellyBean8","userUrl":"https://itunes.apple.com/us/reviews/id293861099","version":"2.3","score":5,"title":"Freaking Awesome","text":"So convenient it’s mind blowing","country":"USA"},{"id":"2520995561","userName":"iyoutome","userUrl":"https://itunes.apple.com/ca/reviews/id344040133","version":"2.3","score":4,"title":"Very User Friendly","text":"This app is awesome.  I just learning astrology but it's very easy to use and has a good set of features.  For example sidereal, forecasting transits, etc.  They do accept suggestions and I'm looking forward to the suggestions I've imputed.  I will be also suggesting using circles for each planet to see interference patterns for predicting the different types of weather, i.e. Physical, etheric etc...  it would be a five but I'm just learning....","country":"Canada"},{"id":"2554283513","userName":"iSorge","userUrl":"https://itunes.apple.com/ru/reviews/id715694263","version":"2.3","score":5,"title":"Денис большой молодец!","text":"Это лучшее, что есть для астрологов и любителей!","country":"Russia"},{"id":"2563024907","userName":"粒雷","userUrl":"https://itunes.apple.com/cn/reviews/id558940811","version":"2.3","score":5,"title":"非常好","text":"好用啊 我的天真的！还很好看啊啊啊啊啊啊啊","country":"China"},{"id":"2491331522","userName":"菠萝卜卜卜","userUrl":"https://itunes.apple.com/cn/reviews/id321494161","version":"2.3","score":5,"title":"This is a really really nice app","text":"谢谢塔君","country":"China"},{"id":"2505105234","userName":"Misbasha","userUrl":"https://itunes.apple.com/mx/reviews/id101780776","version":"2.3","score":5,"title":"Valiosa, muy útil","text":"Es una aplicación muy valiosa y útil, muy recomendable para amateurs, estudiantes de astrología y profesionales. Todo al alcance de tus manos. Fácil de usar y de entender.  \nEs una de mis preferidas🌟🌟🌟🌟🌟","country":"Mexico"},{"id":"2368968763","userName":"Thalarian","userUrl":"https://itunes.apple.com/us/reviews/id268744582","version":"2.2.1","score":5,"title":"[ s i m p l y   m e s m e r i z i n g ]","text":"words cannot describe how absolutely wonderful this app is. it’s incredible, to say the least! i’ve been searching for quite some time for something just like this... and a majority of the important stuff for free- the way it should be. the world needs more of this. keep on keeping on. please. the planetary hours are on point.","country":"USA"},{"id":"2324797041","userName":"MacAddictReturns","userUrl":"https://itunes.apple.com/us/reviews/id113155528","version":"2.2.1","score":5,"title":"Love the app","text":"Definitely a must have for those who believe in the cosmos. Informative and detailed. Loved it!","country":"USA"},{"id":"2363152530","userName":"Men","userUrl":"https://itunes.apple.com/gb/reviews/id86327163","version":"2.2.1","score":5,"title":"Beautiful app, fantastic features!","text":"I'm really impressed with this application! Perhaps one of the most feature full apps I have come across, and they're all really useful. This is a real achievement indeed. \n\nThe one featured that would make this application even better would be if it was possible to see the planetary degree's on the chart. This would make analysis much faster without having to tap on the chart.","country":"UK"},{"id":"2339426017","userName":"joanell","userUrl":"https://itunes.apple.com/au/reviews/id42707470","version":"2.2.1","score":5,"title":"Excellent app","text":"This is a really great app and I am most appreciative for it. Thank you.","country":"Australia"},{"id":"2394494191","userName":"Realex1234","userUrl":"https://itunes.apple.com/ru/reviews/id339612894","version":"2.2.1","score":5,"title":"Классно, но...","text":"Пожалуйста, добавьте дома на транзите и лунный день в дашборде.","country":"Russia"},{"id":"2302722684","userName":"Solenius","userUrl":"https://itunes.apple.com/fr/reviews/id145083264","version":"2.2","score":5,"title":"Great app","text":"This app is pretty impressive because of its stylish design and the many ways you can configure the displays. \nThe solar system view is very original. \nGreat app !","country":"France"},{"id":"2266889751","userName":"Munchkinsrule","userUrl":"https://itunes.apple.com/us/reviews/id170893033","version":"2.1","score":5,"title":"Best I’ve seen","text":"I’m very impressed with all the features of this app. Thank you!","country":"USA"},{"id":"2260307949","userName":"TheSoulsAtlas","userUrl":"https://itunes.apple.com/us/reviews/id268765725","version":"2.1","score":5,"title":"Wonderful App!","text":"Love this app! Clean presentation, lots of planetary info all for free! Glad for the donate option. The planetary hours are a fantastic bonus! Only suggestion is to have a “night view” or dark version for the background. Love love Love!✨","country":"USA"},{"id":"2225204776","userName":"Violin_Player","userUrl":"https://itunes.apple.com/us/reviews/id141481807","version":"2.1","score":5,"title":"Lots of info and controls","text":"This is a really nice app with lots of functionality. There aren't any interfering ads or nonsense interfaces. Everything makes sense and there's lots of information. You can do a bunch of charts as well as look at current transits and there's even a place where you can scrub the motion of the planets with a slider and watch them move in the chart. The developers put a lot of work into this clean, ad free app. It's worth giving it a try.\n\nEDIT: After using this regularly for a few weeks I really like the aspects time line. I use it all the time. I wish I could get a really beefed up desktop version. I’d happily pay. Thanks for a great app.","country":"USA"},{"id":"2147519228","userName":"misjase","userUrl":"https://itunes.apple.com/se/reviews/id8403312","version":"2.0","score":4,"title":"Excellent astrological tool","text":"That an app such as this is offered at no cost is both somewhat a surprise and a joy. Perhaps it is a work in progress yet as it is gives the user much flexibility and reliability, a rather unique work and research environment. It leans more towards research and does not provide much in the area of interpretation of this or that aspect, sign, planet or placement, which I for one very much prefer. It does not replace my astrological tools, but certainly complements them with distinction. I sincerely hope it will remain a work in progress. Thanks to the developer.","country":"Sweden"},{"id":"2131274176","userName":"AnthonyPi93","userUrl":"https://itunes.apple.com/us/reviews/id39162413","version":"1.9","score":5,"title":"Love this app!","text":"This app is great, it has a ton of information and the design and ease of use is awesome. I’ve been doing astrology for over 30 years, from pencils and books, to computer programs, to apps. Other than no capabilities for progressions, it has everything you need!","country":"USA"},{"id":"2139170945","userName":"athena118","userUrl":"https://itunes.apple.com/au/reviews/id153091205","version":"1.9","score":5,"title":"Beautiful & Useful","text":"Gorgeous layout, useful features. The only app where you can view transit-to-natal AND transit-to-transit in the control centre widget which is a favourite feature of mine. Also love how Quintiles and BiQuintiles are included. Great transit timelines and informative aspect explanations. For a free app, it’s awesome. I would pay money for this app but it’s free!!","country":"Australia"},{"id":"2119204787","userName":"JonoKimono","userUrl":"https://itunes.apple.com/au/reviews/id135237521","version":"1.9","score":5,"title":"Very Handy","text":"A really great application with loads of great features","country":"Australia"},{"id":"2035556049","userName":"Anyatheviking","userUrl":"https://itunes.apple.com/us/reviews/id413426181","version":"1.8","score":5,"title":"Different brings insights","text":"I use this app frequently for many many months. He uses different methods of presenting and interacting with traditional astrological data which helps to think differently about what I have learned through the years of study.  The GUI is easy to use, app is focused and info well presented.  I highly recommend it.","country":"USA"},{"id":"1963155486","userName":"Oomaloo","userUrl":"https://itunes.apple.com/us/reviews/id395251787","version":"1.8","score":4,"title":"I love this app","text":"All of its features are very useful! I only wish that I could add Chiron or other things to the charts. I love getting the transit notifications, being able to see planetary hours, and all of the other features this app offers!","country":"USA"},{"id":"1874926660","userName":"Ameeker","userUrl":"https://itunes.apple.com/us/reviews/id124688047","version":"1.8","score":5,"title":"Excellent","text":"This is an excellent tool for the serious student of astrology! I've never seen an astrology app with this much detail and accuracy. I will definitely keep it and could see myself continuing to learn and understand more in the future. A few more notes or explanations would be nice, but they are not necessary for someone who knows what they are doing.","country":"USA"},{"id":"1861089217","userName":"Sutikare","userUrl":"https://itunes.apple.com/us/reviews/id26775785","version":"1.8","score":5,"title":"Excellent app!","text":"This is one of the best astrological apps I’ve come\nAcross. It’s Loaded With multiple features","country":"USA"},{"id":"1853386746","userName":"wallflower647293940","userUrl":"https://itunes.apple.com/us/reviews/id191110789","version":"1.8","score":5,"title":"Amazing","text":"What a useful app. Well edited inputs and intuitive design. Please add a donation button.","country":"USA"},{"id":"1852984277","userName":"Camer222","userUrl":"https://itunes.apple.com/us/reviews/id109438262","version":"1.8","score":5,"title":"Best.astrology.app.ever","text":"Has EVERYTHING","country":"USA"},{"id":"1793476386","userName":"LD the Infinite","userUrl":"https://itunes.apple.com/us/reviews/id262862590","version":"1.8","score":5,"title":"Holy WOW","text":"This App is an \"At your Fingertips\" version of the book, \"The Only Astrology Book You Will Ever Need;\" The only thing missing is the cultural history behind each planet. I am so impressed. It is a complete map of any natal chart with planetary relationships. Just Wow. Holy WOW. How is this free?","country":"USA"},{"id":"1786959739","userName":"thehoneylump","userUrl":"https://itunes.apple.com/us/reviews/id11590796","version":"1.8","score":5,"title":"Solid Astrology Program & Free!","text":"I downloaded this app a few months ago and even though I have professional programs I use for my business, this app is a great resource for quick overviews of transits - mundane & natal - the current sky configuration, and mostly planetary hours! I can plan my day accordingly with those hours so thank you Time Nomad. Last bit of praise goes to Denis and his stellar customer service! Notifications weren't working and not only did this new update fix that, he emailed me from my original request weeks ago informing me they are up and running. You can't beat Time Nomad or it's excellent customer service!!!","country":"USA"},{"id":"1813979031","userName":"Vandykins","userUrl":"https://itunes.apple.com/ca/reviews/id313614115","version":"1.8","score":5,"title":"Stellar!! ~_^","text":"Seriously though, this app is amazing. Intuitive easy to use easy to add multiple people so many different views lovely interface I can't say enough good things about this app.","country":"Canada"},{"id":"1787747066","userName":"pascal1976","userUrl":"https://itunes.apple.com/ca/reviews/id290597952","version":"1.8","score":5,"title":"good apl","text":"excellente application\ndans une prochaine version il serait intéressant d'y ajouter la Lune, de course","country":"Canada"},{"id":"1787219665","userName":"bhubbleemily","userUrl":"https://itunes.apple.com/ca/reviews/id416392180","version":"1.8","score":5,"title":"Excellent","text":"Really informative and easy to use. I'd highly recommend this to anyone interested in astrology at any level.","country":"Canada"},{"id":"1948892550","userName":"Gems0fStars09484","userUrl":"https://itunes.apple.com/au/reviews/id665740132","version":"1.8","score":5,"title":"What a gem!","text":"Extremely helpful and informative. I can look up whatever I need, any time. It allows to see into the future and quickly arranges information in a succinct and useful way. Extremely well done, thank you developer! Keep good stuff coming","country":"Australia"},{"id":"1947180140","userName":"sylviajj","userUrl":"https://itunes.apple.com/au/reviews/id178812070","version":"1.8","score":5,"title":"love it","text":"hope to have more language option otherwise super good!! Keep up the good work","country":"Australia"},{"id":"1994431571","userName":"NJastro","userUrl":"https://itunes.apple.com/ru/reviews/id560405644","version":"1.8","score":5,"title":"Awesome, intuitive, elegant","text":"Очень круто, впечатлена! Спасибо","country":"Russia"},{"id":"1921220887","userName":"SuperDuperDundraren","userUrl":"https://itunes.apple.com/se/reviews/id334859357","version":"1.8","score":5,"title":"Wonderful!","text":"Thank you so much for helping people learn strology and about the aspects of how the planetary forces might impact our lives and help us understand how we can sync with the universe to become better and live better🌸 🙏 🌟🙌","country":"Sweden"},{"id":"1792822159","userName":"Anna_Shama","userUrl":"https://itunes.apple.com/ua/reviews/id505585659","version":"1.8","score":5,"title":"Awesome","text":"Great app! Thank you for adding Koch house system, this I was actually waiting for. Very very good and unusual design of the app. Love to use it! :)","country":"Ukraine"},{"id":"1956974821","userName":"Time Ladyy","userUrl":"https://itunes.apple.com/ar/reviews/id344054118","version":"1.8","score":5,"title":"Completa y linda","text":"Una aplicación para cartas natales y actuales que es fácil de usar, simple y además se ve estéticamente linda (la mayoría de las apps gratis se ven grotescas y suelen estar desactualizadas). Time Nomad tiene todo lo que un astrólogo aficionado o no podría necesitar en su teléfono. La verdad es genial.","country":"Argentina"},{"id":"1903575246","userName":"Cacá Saad","userUrl":"https://itunes.apple.com/br/reviews/id575108718","version":"1.8","score":5,"title":"Sensacional.","text":"Finalmente um app que ajuda no estudo.","country":"Brazil"},{"id":"1821599203","userName":"Gemini Saga 27","userUrl":"https://itunes.apple.com/br/reviews/id244187624","version":"1.8","score":5,"title":"Muito bom","text":"Surpreende a quantidade de informação que esse app fornece gratuitamente. Só falta mesmo textos explicativos do que significa cada posição nos mapas. Show de bola!","country":"Brazil"},{"id":"1823036902","userName":"Piolo222222","userUrl":"https://itunes.apple.com/th/reviews/id598087950","version":"1.8","score":5,"title":"The best ever iphone astrology app","text":"Ton of features and super customizable you made my day and safe my life thank you so much for creating this app","country":"Thailand"},{"id":"1806178554","userName":"Quarnalk","userUrl":"https://itunes.apple.com/us/reviews/id511780950","version":"1.7","score":5,"title":"Solid Chart","text":"Solid app for reading a chart. Couldn't find Chiron though and some charts don't include houses. Great for a free app though.","country":"USA"},{"id":"1769289155","userName":"Yayacolt","userUrl":"https://itunes.apple.com/us/reviews/id37582488","version":"1.7","score":5,"title":"Brilliant app","text":"Brilliant app with almost limitless amounts of information. After several weeks of use I'm still discovering new things I can do or find in the app.","country":"USA"},{"id":"1766647963","userName":"Nsaneartst","userUrl":"https://itunes.apple.com/us/reviews/id148179442","version":"1.7","score":5,"title":"Brilliant","text":"I am relatively new to astrology, but this is proving to be a helpful companion in the learning process. So much information delivered in such a clean and organized fashion. I know I'm just scratching the surface, but still extremely helpful in what I know so far. Thank you for such a potent tool.","country":"USA"},{"id":"1755262586","userName":"ckosel","userUrl":"https://itunes.apple.com/us/reviews/id141379011","version":"1.7","score":5,"title":"Simply an exceptional tool","text":"I'm not a professional astrologer, but nonetheless, this is clearly a well engineered and elegant tool, and is a powerful aid in understanding and advancing my knowledge of astrology.","country":"USA"},{"id":"1729997899","userName":"jeffnphil","userUrl":"https://itunes.apple.com/us/reviews/id15928693","version":"1.7","score":5,"title":"Excellent app, far exceeds others","text":"I've been studying astrology for quite some time and have tried many other apps which most were disappointing. But, this app didn't disappoint and has many functions that would take me quite a long time if I had to do it all by hand. I use it about everyday, it saves me a great deal of time from not having to look up and calculate data. I'm thankful that it's a free app and I greatly appreciate the developer putting the time and effort into this app, thank you for sharing it!","country":"USA"},{"id":"1708948697","userName":"nms506","userUrl":"https://itunes.apple.com/us/reviews/id40548977","version":"1.7","score":4,"title":"Love It, Am Still Confused","text":"I'm very fascinated by this app and have deeply enjoyed examining the data. I think it's rigorous and complex and therefore... confusing for newcomers. A tutorial feature would be nice, or some resource on interpreting the multitude of information.","country":"USA"},{"id":"1686373369","userName":"Guión Moon","userUrl":"https://itunes.apple.com/us/reviews/id324979045","version":"1.7","score":5,"title":"Amazing App","text":"Really has helped me to learn Astrology. It's almost unbelievable that this is free. Donate button needed for sure.","country":"USA"},{"id":"1733639720","userName":"Gomba13","userUrl":"https://itunes.apple.com/ca/reviews/id161297724","version":"1.7","score":3,"title":"Synastry fixed – app clock broken","text":"The synastry feature is all wrong. The comparison chart aligns the ascendants. \n\nUPDATE: The developer promptly corrected the issue. The synastry is apparently perfectly accurate. Works great.\n\nHowever, the current version apparently messes up the app clock on an iPhone7+. After I edit a person, the app clock retrogrades by three hours exact. I edited two persons, same issue – and it is incremental. UTC conversion works. In short, as I use the app, it slowly goes back in time, and reading transit maps is literally a headache. Please fix this. It seriously affects the usability of the app – and the app's user. Update: it is the sample Adam and Eve characters that mess up the app clock when you edit them. Persons created \"from scratch\" don't seem affected by this bug.","country":"Canada"},{"id":"1716150002","userName":"JayWinterr","userUrl":"https://itunes.apple.com/ca/reviews/id137777371","version":"1.7","score":4,"title":"What about the asteroids?","text":"I love the app. It's amazing. How come the Astroids/Chiron isn't included with the charts?","country":"Canada"},{"id":"1691659269","userName":"nayge","userUrl":"https://itunes.apple.com/fr/reviews/id101229347","version":"1.7","score":5,"title":"Excellent et efficace 😊","text":"Application très efficace et très précise il faut continuer à développer cette application","country":"France"},{"id":"1707990810","userName":"Vik-007","userUrl":"https://itunes.apple.com/ua/reviews/id524838132","version":"1.7","score":5,"title":"Nice app","text":"I use it every day","country":"Ukraine"},{"id":"1724479178","userName":"Mary the Sad Cocoppa Play Fan","userUrl":"https://itunes.apple.com/pl/reviews/id318365373","version":"1.7","score":5,"title":"Great!","text":"Serious amateur here- great app, I use it every day, easy to use- v. Intuitive- and good looking. Looking forward to any new updates :)","country":"Poland"},{"id":"1683200414","userName":"Mummancs","userUrl":"https://itunes.apple.com/hu/reviews/id203941103","version":"1.7","score":5,"title":"Best astrology app!","text":"I love this app! I can check transit chart and natal chart, and I can get notification about coming transits. I also can check natal aspects, and design also nice! If someone do not know about planets meaning no problem, because they can read it in app! I missing synastry chart, because I only find composite chart, but this app really the best! Love it!","country":"Hungary"},{"id":"1674518143","userName":"carrifaery","userUrl":"https://itunes.apple.com/us/reviews/id424777269","version":"1.6","score":5,"title":"Baller","text":"Omg thank heavens for this app. Astrologer gangster approved.","country":"USA"},{"id":"1648069425","userName":"AltGrendel","userUrl":"https://itunes.apple.com/us/reviews/id278545360","version":"1.6","score":4,"title":"Really good app","text":"Handy for interpretation for the most part. I just wish there was a Elements/Qualities table. Other than that it's really good as a quick reference.","country":"USA"},{"id":"1638688701","userName":"Tachikaze7","userUrl":"https://itunes.apple.com/us/reviews/id105011760","version":"1.6","score":5,"title":"Free! And does more than other expensive apps!","text":"I keep discovering new features on this app.  It is extremely useful once you get a feel for the design and layout.  I'm loving it!","country":"USA"},{"id":"1637693001","userName":"Belroth","userUrl":"https://itunes.apple.com/us/reviews/id6007507","version":"1.6","score":5,"title":"A Great App - For Astrology Pros","text":"This app is one of the best I have found after searching through ENDLESS App Store astrology searches.  It lets you essentially perform a transit calculation for all of your own natal planets, lets you compare yourself to others (synnestry), and many other features..!  It even has a way to put the current planet positions up as a widget!  Way good work, you guys!","country":"USA"},{"id":"1637302287","userName":"Whattt??","userUrl":"https://itunes.apple.com/us/reviews/id86273183","version":"1.6","score":5,"title":"Really Dope","text":"This all is all you need and more with the ability to see natal charts hundreds of years into the future and past which is really cool to see. The simplified interface may seem confusing at first but easy to handle. Five Stars!","country":"USA"},{"id":"1633704290","userName":"Ashaandriana","userUrl":"https://itunes.apple.com/us/reviews/id153991306","version":"1.6","score":5,"title":"Best astrology app for me","text":"I have purchased many astrology apps and his is by far my favorite. I love that everything is up to date, it keeps the natal chart interpretations current. I love this app and would recommend it.","country":"USA"},{"id":"1625302900","userName":"PFraterdeus","userUrl":"https://itunes.apple.com/us/reviews/id33095350","version":"1.6","score":4,"title":"Interesting and data rich, but no export?","text":"Time Nomad offers a unique approach to astrological data. A variety of graphical representations provide transit and relational information whether Natal or synastric or composite.\nSlider controllers provide interactive input for temporal adjustment and transit or aspect rendering...\nHowever, while it's all interesting, and clearly the design and features are worthy of some praise, the immediately obvious stumbling block is the lack of any way to export ones data...","country":"USA"},{"id":"1618282200","userName":"Victoria-vip","userUrl":"https://itunes.apple.com/us/reviews/id164571420","version":"1.6","score":5,"title":"Amazing","text":"So nice app! Real time progressions directions . I do enjoying","country":"USA"},{"id":"1601172379","userName":"barcols","userUrl":"https://itunes.apple.com/us/reviews/id515778867","version":"1.6","score":5,"title":"Tap a morning star & put it in your pocket","text":"Save it for a rainy day.","country":"USA"},{"id":"1599395642","userName":"곰통","userUrl":"https://itunes.apple.com/us/reviews/id244009382","version":"1.6","score":5,"title":"sehr gut","text":"super geile APP!!","country":"USA"},{"id":"1599079548","userName":"MikhailSean","userUrl":"https://itunes.apple.com/us/reviews/id108000212","version":"1.6","score":4,"title":"GREAT New app. Totally Worth exploring!","text":"This app is definitely a undiscovered gem! At first it's easy to get confused but it's great once you figure out the proper way to navigate! It gives you access to all aspects of your birth chart.. from past to present! Definitely worth the download!","country":"USA"},{"id":"1593497500","userName":"Fujoshi_Hime","userUrl":"https://itunes.apple.com/us/reviews/id228023197","version":"1.6","score":5,"title":"My New Fave For Chart Creation!!!","text":"Was using a different app for a while but i love this one sooo much more!! Much easier to get details and make minor adjustments as needed. An excellent tool for on the go readings and quick checking of transits!! 😍","country":"USA"},{"id":"1592307251","userName":"Gabi Pen","userUrl":"https://itunes.apple.com/us/reviews/id343085523","version":"1.6","score":5,"title":"Excellent","text":"Great app, I've been looking for a good tool to draw natal charts. This app finds locations accurately, and it shows many details of the charts and other features. Great work on this!! Thank you.","country":"USA"},{"id":"1590662564","userName":"kristinae11","userUrl":"https://itunes.apple.com/us/reviews/id157636306","version":"1.6","score":4,"title":"Really outstanding app","text":"This app is packed. Lots of features and options. I would also ask for the glyphs to be larger with degrees. Keep up the good work!","country":"USA"},{"id":"1624186340","userName":"Haris Liviu","userUrl":"https://itunes.apple.com/gb/reviews/id136312123","version":"1.6","score":5,"title":"Wow! Love it !!!","text":"One of the best astrology app ever!!! I love the minimal design. Best UI for a astrology app. Just wow. Thank you!!!! Real Stardust this app!!! So smart !","country":"UK"},{"id":"1596049953","userName":"Lapzzdg","userUrl":"https://itunes.apple.com/ca/reviews/id87174058","version":"1.6","score":4,"title":"Great app to learn and track aspects","text":"Absolutely love this app. Would become significantly better if it were more responsive when clicking on signs, planets and houses under the different functions it offers.","country":"Canada"},{"id":"1674330556","userName":"DavidQiria","userUrl":"https://itunes.apple.com/ru/reviews/id477694926","version":"1.6","score":5,"title":"Моё восхищение!","text":"Огромное спасибо за столь скрупулёзный труд! Программа отвечает всем требованиям астролога-любителя! Я в восторге!","country":"Russia"},{"id":"1630459911","userName":"Tari4","userUrl":"https://itunes.apple.com/ru/reviews/id151610164","version":"1.6","score":5,"title":"Лучшее астрологическое приложение","text":"А мой взгляд это лучшее мобильное приложение по транзитной астрологии. Очень удобный, красивый, современный и интуитивно понятный интерфейс. Автор огромное спасибо! Из личных пожеланий: хотелось бы менять орбис аспектов)","country":"Russia"},{"id":"1599170721","userName":"Inagarbe","userUrl":"https://itunes.apple.com/es/reviews/id525800337","version":"1.6","score":5,"title":"Absolutamente maravillosa!!","text":"Al principio resulta un poco difícil hacerse a ella por la gran cantidad de posibilidades que ofrece, pero tras curiosear bien todo queda claro. El diseño es sencillo y limpio, ideal para centrarse en los aspectos. \n\nAl despertarte te envía un aviso con la lunación del día, o aspectos en tránsito que afecten a tu carta. Puedes archivar y analizar cuantas cartas natales quieras, observar el gráfico con todos los aspectos, u omitiendo algunos; avanzando en los días de la semana para adelantarte a los tránsitos.   Incluye la opción de llevar a cabo sinastrías, lo que es un +10\n\nPor pedir... La opción de realizar revoluciones solares y lunares sería un puntazo! También sería divertido contar con un pequeño apartado de \"diario\"; para llevar dentro de la propia app un diario lunar o algo así.\n\nPero vamos, que lo dicho... ¡Una verdadera gozada! 100% recomendable.","country":"Spain"},{"id":"1626005343","userName":"Kalinamou","userUrl":"https://itunes.apple.com/bg/reviews/id573946030","version":"1.6","score":4,"title":"Good job","text":"Nice try. Work to improve it. Make it more useful. Not so much physics needed. The auditory will increase if you make it more understandable and describe in what way the transits impact our life. I am not sure if they match correctly for now.. But work on it. Good luck and благодаря!","country":"Bulgaria"},{"id":"1577797153","userName":"goldenozaro","userUrl":"https://itunes.apple.com/us/reviews/id42978928","version":"1.5","score":5,"title":"Love it","text":"Please dont let this app never down","country":"USA"},{"id":"1568469700","userName":"LiquidScience","userUrl":"https://itunes.apple.com/us/reviews/id39055495","version":"1.5","score":5,"title":"Just what I was looking for","text":"This app is amazing. I was looking for something that had chart data, aspects, transits and a nice clean layout. This app has surpassed my expectations. Thank you so much for making this!","country":"USA"},{"id":"1566549441","userName":"tvachon","userUrl":"https://itunes.apple.com/us/reviews/id17425517","version":"1.5","score":5,"title":"Amazing.","text":"This app's existence doesn't make sense. Incredible value for the money.","country":"USA"},{"id":"1565231306","userName":"The Velcromancer","userUrl":"https://itunes.apple.com/us/reviews/id142299601","version":"1.5","score":5,"title":"This is amazing.","text":"I can't believe all this is free! An excellent app.","country":"USA"},{"id":"1563591909","userName":"swell_elle","userUrl":"https://itunes.apple.com/us/reviews/id199473549","version":"1.5","score":5,"title":"Impressive!","text":"With the exception of printing, this app is amazing. The interface is CLEAN, no distraction - just a pleasant user experience. Full featured too! I can't believe it's FREE!","country":"USA"},{"id":"1561535065","userName":"MoonMedicine","userUrl":"https://itunes.apple.com/us/reviews/id23026161","version":"1.5","score":5,"title":"Magnificent! The app I've been waiting for","text":"This app is amazing. Applause to the creator and developers. It's clean and easy to use. I love that I can see both tropical and sidereal charts. This app has everything you need on the go. I love that I can save multiple charts and events. It's so easy to see what's happening in the sky! I love that there are descriptions as well. Very well done. Thank you so much for this app!!!!","country":"USA"},{"id":"1554548792","userName":"Yahyabateny","userUrl":"https://itunes.apple.com/us/reviews/id367775776","version":"1.5","score":5,"title":"Magnificent!! Amazing, amazing and amazing!!!","text":"For talking about this amazing app, I need to open my oxford as well as cambridge dictionary to find correct admiring words for that.\nWords that i can say about it are listed here:\n- gentle \n- sweet\n- idealized\n- full feature\n- sharp\n- absolute\n- perfect\n- reliable\n- handy\n...\nOk, if i continue writing the words; i can do it for hours. There are three chart for you in this app: Natal Chart, Transits and Sky Now.\nWith this app, you can look at your future very carefully; and fortunately the app is free of charge, even there is no button for donation!!\nPlease add a button for donate!\nA must have app for any astrologist from beginners to professionals.\nThanks a lot for all you have done.\n..\nThe latest update made it really useful, because you can find transiting chart in notification center. All the best, dear Developer!\n..\nThe only thing that i can say about this app:\nNo.1","country":"USA"},{"id":"1554458728","userName":"Laurence Z.","userUrl":"https://itunes.apple.com/us/reviews/id25116101","version":"1.5","score":5,"title":"For me, a deep dive into learning astro","text":"This obviously is an app well over my head, but for what it gives and for free, wow. A tool that points to those curious, areas to learn, seek out meanings.\n\nI am a first step novice here, on a path of discovery. This is my guide on that path for now.","country":"USA"},{"id":"1552812611","userName":"Redheadedtemper","userUrl":"https://itunes.apple.com/us/reviews/id22393306","version":"1.5","score":5,"title":"It's about time!","text":"Just discovered this app today and after a quick once over I'm delighted to dive right back in again.  I'm impressed with the original layout and function - in my opinion I think it's rather original and caters to the nerd in me.  Not newspaper fluff...finally, something a little new and more creative that will pique your curiosity. Thank you for delivering up some fresh content.  Well done.","country":"USA"},{"id":"1550307877","userName":"Astrologicalo","userUrl":"https://itunes.apple.com/us/reviews/id552697548","version":"1.5","score":5,"title":"Wonderfully splendid","text":"This app is easy to use and chalk full of information!!! I highly recommend it!","country":"USA"},{"id":"1550124814","userName":"Spiritsfly","userUrl":"https://itunes.apple.com/us/reviews/id408807742","version":"1.5","score":5,"title":"LOVE IT","text":"Great astrology app!!!! 🎉🎉❤️ still figuring out what's What since I just got it but there is A LOT packed in this app and I'm excited to explore and know what everything does. And I love the focus on aspects this app has, very detailed too.","country":"USA"},{"id":"1548855519","userName":"nini121412","userUrl":"https://itunes.apple.com/us/reviews/id307655103","version":"1.5","score":5,"title":"Great App For Astrology","text":"the only astrology app I love the most, highly recommended","country":"USA"},{"id":"1546622889","userName":"Ballofyellow","userUrl":"https://itunes.apple.com/us/reviews/id26098979","version":"1.5","score":5,"title":"Great App!!!","text":"Very clean layout\nVery easy to edit\nVery advanced tools\nVariety of aspects factored","country":"USA"},{"id":"1546429531","userName":"MuvaAK","userUrl":"https://itunes.apple.com/us/reviews/id206687814","version":"1.5","score":5,"title":"LOVE this app!","text":"Packed with information yet easy to understand even for a novice and easy on the eyes. It made sense of things books failed to help me understand. Love it!","country":"USA"},{"id":"1545485368","userName":"nanacathyjean","userUrl":"https://itunes.apple.com/us/reviews/id146252752","version":"1.5","score":5,"title":"Super sweet","text":"Have never wrote a review for app in my life but this is awesome . Thank you","country":"USA"},{"id":"1540379506","userName":"RandyGiersberg","userUrl":"https://itunes.apple.com/us/reviews/id287694610","version":"1.5","score":5,"title":"Killer App","text":"Great app. Calculates so much. Not watered down. User interface a little tricky but I figured it out. Only feature I could request is that the info panel for meanings of planets and aspects is available in more places like the timeline etc.","country":"USA"},{"id":"1534151157","userName":"Coffeeteankitty","userUrl":"https://itunes.apple.com/us/reviews/id514022168","version":"1.5","score":5,"title":"Amazing update!👌🏻👌🏻👌🏻","text":"My 2nd review for this app, thank you, thank you for the awesome update!!!☺☺☺","country":"USA"},{"id":"1530415368","userName":"Daghda02","userUrl":"https://itunes.apple.com/us/reviews/id189909494","version":"1.5","score":5,"title":"Best App for Astrology or magical practice","text":"The chart system is great, every feature seems to work.  This app is especially one of the best resources for planetary time calculation.  It allows predictive planetary time, which is a big deal for planning fortuitous times, and magical operations.  This is the only IOS app that does this to my knowledge.","country":"USA"},{"id":"1535759812","userName":"Tony twenty two toes","userUrl":"https://itunes.apple.com/gb/reviews/id127344216","version":"1.5","score":5,"title":"Very well produced","text":"Absolutely brilliant app, can make it give you notifications for planetary aspects and widget feature - bloody fantastic, I never rate apps but this blew me away","country":"UK"},{"id":"1537067327","userName":"domez deeper","userUrl":"https://itunes.apple.com/it/reviews/id121737550","version":"1.5","score":4,"title":"Very good app","text":"Simple, efficient with a friendly interface. Good if you need astrological data. Some improvements to do on natal chart. Thx to developer","country":"Italy"},{"id":"1562380875","userName":"Anonumnumnumnum","userUrl":"https://itunes.apple.com/ru/reviews/id289053406","version":"1.5","score":5,"title":"Лучшее в апстор","text":"Долго искал нормальное приложение на айпад и тут мне попалось это чудо! Настолько удобный интерфейс я ещё не видел: все аспекты, планеты в знаках, все можно быстро просмотреть. Я даже думал эта урезанная версия и начал искать платную, НО ПРИЛОЖЕНИЕ БЕСПЛАТНО! Это находка для современного астролога. Может профи меня и засмеют, но меня все устраивает. Жаль только русского языка нет, но думаю в 2017 году это не проблема)","country":"Russia"},{"id":"1560322945","userName":"cupcake20162015","userUrl":"https://itunes.apple.com/mx/reviews/id149915020","version":"1.5","score":1,"title":"Confusa e inservible","text":"Parece que tiene mucha información y que esta está bien organizada pero es mentira. Sin embargo lo más importante es que no respeta el horario que proporcionas, por default todo lo pone a las nueve y no puede corregirse, entonces terminas con un montón de cartas todas con el mismo horario. Lo poco que pude checar de las ciudades que ya vienen incorporadas en el índice quieras o no, no me proporcionó la suficiente confianza. No es claro que es lo que se necesita pagar y no por lo que terminé perdiendo mi tiempo con información que nunca voy a usar. 😡","country":"Mexico"},{"id":"1559758192","userName":"Jamesfranciscus","userUrl":"https://itunes.apple.com/br/reviews/id191184162","version":"1.5","score":5,"title":"Very good app! Congrats!","text":"Very useful and rare tools.","country":"Brazil"},{"id":"1543107094","userName":"Kretenailian","userUrl":"https://itunes.apple.com/bg/reviews/id411404691","version":"1.5","score":5,"title":"The best app","text":"Full specter of information and details on the matter.","country":"Bulgaria"},{"id":"1567588561","userName":"Coni Vergara","userUrl":"https://itunes.apple.com/cl/reviews/id393296961","version":"1.5","score":5,"title":"Muy buena","text":"Aún no termino de explotarla pero me gusta.","country":"Chile"},{"id":"1583199839","userName":"michael_tain","userUrl":"https://itunes.apple.com/ro/reviews/id106773828","version":"1.5","score":5,"title":"Super aplicație","text":"Cea mai bună aplicație de astrologie de până acum. Și e complet gratuită!","country":"Romania"},{"id":"1528515282","userName":"Somkiat00","userUrl":"https://itunes.apple.com/th/reviews/id397671919","version":"1.5","score":5,"title":"Good","text":"ไม่แน่ใจว่าเป็นช่วงทดลองฟรีหรือเปล่า แต่มันเจ๋งมาก ชอบๆ ถ้าเจอก่อนหน้านี้คงดีจะได้ไม่ต้องเสียเงินซื้อหลายแอพเลยครับ อาจเป็นเพราะชื่อแอพค้นหายากมั้งครับ","country":"Thailand"},{"id":"1518099649","userName":"Ampxxxx","userUrl":"https://itunes.apple.com/us/reviews/id519306488","version":"1.4","score":5,"title":"Awesome","text":"This is a really good app for a novice of astrology like me because it shows all the descriptions you need to make out a chart. Please keep it up!","country":"USA"},{"id":"1498909268","userName":"xtydb","userUrl":"https://itunes.apple.com/us/reviews/id106328927","version":"1.4","score":5,"title":"Amazing","text":"So much information in a clean design. Pretty much perfect except that it makes me want to spend the day delving into the vast info it provides.","country":"USA"},{"id":"1498523902","userName":"NatBoomBat","userUrl":"https://itunes.apple.com/us/reviews/id24679727","version":"1.4","score":5,"title":"This app is amazing.","text":"Super useful sine it allows you to see your own personal transits as well as save other natal charts. Well worth checking out if your into any aspects of astrology.","country":"USA"},{"id":"1496712846","userName":"Leoloe6395","userUrl":"https://itunes.apple.com/us/reviews/id29872175","version":"1.4","score":5,"title":"Great app","text":"Love the info and layout one of my fav apps","country":"USA"},{"id":"1512774419","userName":"Jfbongarcon","userUrl":"https://itunes.apple.com/ca/reviews/id100024429","version":"1.4","score":5,"title":"Amazing heliocentric maps","text":"What a beautiful app.\nIt has almost everything I need to start studying this dense subject.\n\nI love the uncluttered feel of the charts, and the ease of navigation. But I would love to be able to see the houses on the charts directly when I need to see them.\n\nI'd also love to see hojses on heliocentric maps as those are the most important feature to help me understand astrology in general.\n\nThank-you so much for putting in as much effort, detail and love into creating this beautiful app. I see you have a real passion for the subject and for beauty.","country":"Canada"},{"id":"1506250081","userName":"Niveyn","userUrl":"https://itunes.apple.com/ca/reviews/id12253994","version":"1.4","score":5,"title":"The Ideal Astrology App","text":"What an amazing astrology app. It was all I was looking for and a whole lot more. The new moon widget is great.","country":"Canada"},{"id":"1521485918","userName":"Wilz3","userUrl":"https://itunes.apple.com/au/reviews/id223373943","version":"1.4","score":5,"title":"Great app","text":"Great looking and functional app. Lots of features to bring Astrology to life.\nGreat for transits.\nReally nothing else on app store in its class.\n\nThanks","country":"Australia"},{"id":"1476525987","userName":"OneLittlet","userUrl":"https://itunes.apple.com/us/reviews/id24510119","version":"1.3.4","score":5,"title":"Great....but","text":"Not the easiest app to navigate through. Give yourself time learn where everything thing is and how it all works. Wish there was a section explaining basic things...such as what the different colors mean. Other than that...it's great!","country":"USA"},{"id":"1493939129","userName":"Bonksz","userUrl":"https://itunes.apple.com/gb/reviews/id407198813","version":"1.3.4","score":5,"title":"Love","text":"Love this app! Although could be made a little more understandable for those who want to start learning or those who are just interested in knowing exactly what they're reading or looking at","country":"UK"},{"id":"1474006922","userName":"A.E.A.759","userUrl":"https://itunes.apple.com/us/reviews/id275036675","version":"1.3.3","score":5,"title":"Amazing","text":"I tend to avoid leaving reviews for apps but this one I couldn't pass up. This app is simply amazing.","country":"USA"},{"id":"1431300417","userName":"chun xiao","userUrl":"https://itunes.apple.com/cn/reviews/id328209133","version":"1.2","score":3,"title":"NO NO NO……","text":"软件的星盘设计非常漂亮…\n但是希望有度数在…创建本命盘时 系统可不可以自动输入UTC时间……\n谢谢 望改进……","country":"China"},{"id":"1420600691","userName":"Prettycleverkid","userUrl":"https://itunes.apple.com/us/reviews/id178169908","version":"1.1","score":5,"title":"Thank you","text":"I cant believe you are not charging for this. I love it! Thank you so much! It has the cutest most perfect Layout and very useful interpretations as well. For natal and Transits. I never review anything. This deserved something. Add a donate button ;)","country":"USA"},{"id":"1353379297","userName":"nathanjaye","userUrl":"https://itunes.apple.com/us/reviews/id206496072","version":"1.0","score":5,"title":"The BEST astrology app","text":"Great design and easy to use.","country":"USA"}]